src/bsl/DataProcessors/гкс_АРМПромежуточныйКомпозит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>гкс_АРМПромежуточныйКомпозит</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСостояний</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Силос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСуткиРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРегистраций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СостоянияРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СостоянияРегистрации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияРегистрации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_КомпозитныеПробы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_КомпозитныеПробы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроизводственныеСуткиРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомпозитнаяПроба</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ФормированиеНомераПробы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
						<v8:Type>cfg:DocumentRef.гкс_ФормированиеНомераПробы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СопоставлениеФНПЛабАнализа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СопоставлениеФНПЛабАнализа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛабораторныйАнализ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЛабораторныйАнализ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсиленныйКонтроль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФормированиеНомераПробы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ФормированиеНомераПробы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СвязьРегистрацииИТранспортногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СвязьРегистрацииИТранспортногоДокумента</Name>
			<Comment>Транспортные документы регистрации</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТранспортныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ТранспортныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ПоказателиУсиленногоКонтроляПоРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ПоказателиУсиленногоКонтроляПоРегистрации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателяМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателяМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Базис</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКачества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияКачества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклонятьКачество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСутки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛабораторныйАнализ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЛабораторныйАнализ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПробы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыПроб</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СоставГруппТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СоставГруппТранспорта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГруппаТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ГруппыТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияТранспорта</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ЗаблокированныеРегистрацииУсиленныйКонтроль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ЗаблокированныеРегистрацииУсиленныйКонтроль</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БлокирующееСостояниеКачества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияКачества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разблокировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БлокирующаяРегистрация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БлокирующаяГруппаТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ГруппыТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_ТипРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыПроб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыПроб</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Композитная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/DataProcessors/гкс_АРМПромежуточныйКомпозит/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Данные для списка.
//
// Параметры:
//  Параметры Параметры
//  ТипСписка - Строка - Тип списка
//
// Возвращаемое значение:
//  ТаблицаЗначений - Данные для списка
Функция ДанныеДляСписка(Параметры, ТипСписка = "ПроизвольныйКомпозит") Экспорт

	Запрос = Новый Запрос;

	Если ТипСписка = "ПроизвольныйКомпозит" Тогда
		Запрос.Текст = ТекстЗапросаДанныеДляПроизвольногоКомпозита();

		Если Параметры.ПоказыватьВсе Тогда
			ТекстУсловияПоСостоянию = "ИСТИНА";
		Иначе
			ТекстУсловияПоСостоянию = "СостоянияРегистрации.Состояние В (&СписокСостояний)";
			Запрос.УстановитьПараметр("СписокСостояний", СписокСостояний);
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстУсловияПоСостоянию", ТекстУсловияПоСостоянию);

	ИначеЕсли ТипСписка = "УсиленныйКонтроль" Тогда
		Запрос.Текст = ТекстЗапросаДанныеДляУсиленногоКонтроля();

		Если Параметры.ПоказыватьВсе Тогда
			ТекстУсловияПоСостояниюКачества = "ИСТИНА";
		Иначе
			СписокСостоянийКачества = Новый Массив;
			СписокСостоянийКачества.Добавить(Перечисления.гкс_СостоянияКачества.ПустаяСсылка());
			СписокСостоянийКачества.Добавить(Перечисления.гкс_СостоянияКачества.ОтборПроб);

			ТекстУсловияПоСостояниюКачества =
				"ПоказателиУсиленногоКонтроляПоРегистрации.СостояниеКачества В (&СписокСостоянийКачества)";
			Запрос.УстановитьПараметр("СписокСостоянийКачества", СписокСостоянийКачества);
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстУсловияПоСостояниюКачества", ТекстУсловияПоСостояниюКачества);

	ИначеЕсли ТипСписка = "УсиленныйКонтрольДляТС" Тогда
		Запрос.Текст = ТекстЗапросаДанныеДляУсиленногоКонтроляДляТС();

		Если Параметры.ПоказыватьВсе Тогда
			ТекстУсловияПоСостояниюКачества = "ИСТИНА";
		Иначе
			СписокСостоянийКачества = Новый Массив;
			СписокСостоянийКачества.Добавить(Перечисления.гкс_СостоянияКачества.ПустаяСсылка());
			СписокСостоянийКачества.Добавить(Перечисления.гкс_СостоянияКачества.ОтборПроб);

			ТекстУсловияПоСостояниюКачества =
				"ПоказателиУсиленногоКонтроляПоРегистрации.СостояниеКачества В (&СписокСостоянийКачества)";
			Запрос.УстановитьПараметр("СписокСостоянийКачества", СписокСостоянийКачества);
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстУсловияПоСостояниюКачества", ТекстУсловияПоСостояниюКачества);
	КонецЕсли;

	// Общие параметры для обоих типов списков
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.КонецПериода);
	Запрос.УстановитьПараметр("ПроизводственныеСутки", Параметры.ПроизводственныеСуткиРегистрации);

	Запрос.УстановитьПараметр("ОтборНоменклатура", Номенклатура);
	ТекстУсловияПоНоменклатуре = СформироватьТекстУсловияОтбора(Номенклатура,
		"РегистрацияНаПЛК.Номенклатура", "ОтборНоменклатура");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстУсловияПоНоменклатуре", ТекстУсловияПоНоменклатуре);

	Запрос.УстановитьПараметр("ОтборКонтрагент", Контрагент);
	ТекстУсловияПоКонтрагенту = СформироватьТекстУсловияОтбора(Контрагент, "РегистрацияНаПЛК.Контрагент",
		"ОтборКонтрагент");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстУсловияПоКонтрагенту", ТекстУсловияПоКонтрагенту);

	Запрос.УстановитьПараметр("ПоказыватьВсе", Параметры.ПоказыватьВсе);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Данные для список промежуточные пробы.
//
// Параметры:
//  Параметры Параметры
//
// Возвращаемое значение:
//  ТаблицаЗначений - Данные для список промежуточные пробы
Функция ДанныеДляСписокПромежуточныеПробы(Параметры) Экспорт

	Запрос	= Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныеДляПромежуточныхПроб();

	Запрос.УстановитьПараметр("СписокСостояний", СписокСостояний);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.КонецПериода);
	Запрос.УстановитьПараметр("ПроизводственныеСутки", Параметры.ПроизводственныеСуткиРегистрации);

    НазначенияИспользованияКачества = Новый Массив;
	НазначенияИспользованияКачества.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.ДополнительныйАнализ);
    НазначенияИспользованияКачества.Добавить(Перечисления.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит);
	Запрос.УстановитьПараметр("НазначенияИспользованияКачества", НазначенияИспользованияКачества);


	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Данные для список регистрации промежуточных проб.
//
// Параметры:
//  Параметры Параметры
//
// Возвращаемое значение:
//  ТаблицаЗначений - Данные для список регистрации промежуточных проб
Функция ДанныеДляСписокРегистрацииПромежуточныхПроб(Параметры) Экспорт

	Запрос	= Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныеДляРегистрацииПромежуточныхПроб();

	Запрос.УстановитьПараметр("ДокументФормированиеНомераПробы", Параметры.ДокументФормированиеНомераПробы);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


// Формирует текст условия отбора для запроса
//
// Параметры:
//  ЗначениеОтбора - Произвольный - Значение отбора
//  ИмяПоляВЗапросе - Строка - Имя поля в тексте запроса
//  ИмяПараметра - Строка - Имя параметра запроса
//
// Возвращаемое значение:
//  Строка - Текст условия
//
Функция СформироватьТекстУсловияОтбора(ЗначениеОтбора, ИмяПоляВЗапросе, ИмяПараметра)

	Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		Возврат СтрШаблон("%1 = &%2", ИмяПоляВЗапросе, ИмяПараметра);
	Иначе
		Возврат "ИСТИНА";
	КонецЕсли;

КонецФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаДанныеДляПроизвольногоКомпозита()

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	СостоянияРегистрации.Состояние КАК Состояние
	|ПОМЕСТИТЬ ВТ_Регистрации
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних(, ВидПеревозки = &ВидПеревозки
	|	И ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|	И ТочкаМаршрута = &ТочкаМаршрута) КАК СостоянияРегистрации
	|ГДЕ
	|	СостоянияРегистрации.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И &ТекстУсловияПоСостоянию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КомпозитныеПробы.ДокументРегистрации КАК ДокументРегистрации,
	|	КомпозитныеПробы.КомпозитнаяПроба КАК КомпозитнаяПроба,
	|	ЕСТЬNULL(СправочникНомераПроб.Код, """") КАК НомерПробы,
	|	КомпозитныеПробы.ПроизводственныеСуткиРегистрации КАК ПроизводственныеСутки
	|ПОМЕСТИТЬ ВТ_КомпозитныеПробы
	|ИЗ
	|	РегистрСведений.гкс_КомпозитныеПробы КАК КомпозитныеПробы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
	|		ПО ВТ_Регистрации.ДокументРегистрации = КомпозитныеПробы.ДокументРегистрации
	|		И КомпозитныеПробы.ВидПеревозки = &ВидПеревозки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ДокументФНП
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_НомерПробы КАК СправочникНомераПроб
	|			ПО ДокументФНП.НомерПробы = СправочникНомераПроб.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СопоставлениеФНПЛабАнализа КАК СопоставлениеФНПЛА
	|			ПО ДокументФНП.Ссылка = СопоставлениеФНПЛА.ФормированиеНомераПробы
	|		ПО КомпозитныеПробы.КомпозитнаяПроба = ДокументФНП.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(СопоставлениеФНПЛА.НазначениеИспользования,
	|		ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ДополнительныйАнализ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Регистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	ФормированиеНомераПробы.Ссылка КАК ЕдиничнаяПроба,
	|	ЕСТЬNULL(СправочникНомераПроб.Код, """") КАК НомерПробы
	|ПОМЕСТИТЬ ВТ_ЕдиничныеПробы
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
	|		ПО ВТ_Регистрации.ДокументРегистрации = ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_НомерПробы КАК СправочникНомераПроб
	|			ПО ФормированиеНомераПробы.НомерПробы = СправочникНомераПроб.Ссылка
	|		ПО ФормированиеНомераПробыСписокРегистраций.Ссылка = ФормированиеНомераПробы.Ссылка
	|		И ФормированиеНомераПробы.Проведен
	|		И ФормированиеНомераПробы.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрацияНаПЛК.Ссылка КАК ДокументРегистрации,
	|	РегистрацияНаПЛК.Дата КАК ДатаРегистрации,
	|	РегистрацияНаПЛК.Номер КАК НомерРегистрации,
	|	РегистрацияНаПЛК.Организация КАК Организация,
	|	РегистрацияНаПЛК.ВидПеревозки КАК ВидПеревозки,
	|	РегистрацияНаПЛК.ТочкаМаршрута КАК ПЛК,
	|	РегистрацияНаПЛК.Контрагент КАК Контрагент,
	|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура,
	|	РегистрацияНаПЛК.ТранспортноеСредство КАК ТранспортноеСредство,
	|	РегистрацияНаПЛК.ПунктПогрузки КАК ПунктПогрузки,
	|	ЕСТЬNULL(НаправлениеНаРазгрузку.Ссылка, ЗНАЧЕНИЕ(Документ.гкс_НаправлениеНаРазгрузку.ПустаяСсылка)) КАК
	|		НаправлениеНаРазгрузку,
	|	ЕСТЬNULL(ВТ_КомпозитныеПробы.КомпозитнаяПроба, ЗНАЧЕНИЕ(Документ.гкс_ФормированиеНомераПробы.ПустаяСсылка)) КАК
	|		ДокументКомпозитнаяПроба,
	|	ЕСТЬNULL(ВТ_КомпозитныеПробы.НомерПробы, NULL) КАК НомерПромежуточногоКомпозита,
	|	ЕСТЬNULL(ВТ_ЕдиничныеПробы.ЕдиничнаяПроба, ЗНАЧЕНИЕ(Документ.гкс_ФормированиеНомераПробы.ПустаяСсылка)) КАК
	|		ФормированиеПробы,
	|	ЕСТЬNULL(ВТ_ЕдиничныеПробы.НомерПробы, NULL) КАК НомерПробы,
	|	ЕСТЬNULL(ВТ_Регистрации.Состояние, ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.ПустаяСсылка)) КАК Состояние,
	|	ЕСТЬNULL(СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент.ПунктПогрузки.КодСтанцииЖД,
	|		ЗНАЧЕНИЕ(Справочник.гкс_КлассификаторСтанцийЖД.ПустаяСсылка)) КАК СтанцияОтправления,
	|	ЕСТЬNULL(СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент.ПунктПогрузки.КодСтанцииЖД.НаименованиеПолное,
	|		СТРОКА(10)) КАК СтанцияОтправленияПредставление
	|ИЗ
	|	ВТ_Регистрации КАК ВТ_Регистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ПО ВТ_Регистрации.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_НаправлениеНаРазгрузку КАК НаправлениеНаРазгрузку
	|		ПО ВТ_Регистрации.ДокументРегистрации = НаправлениеНаРазгрузку.ДокументРегистрации
	|		И НаправлениеНаРазгрузку.Проведен
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК ВзвешиваниеВъезд
	|		ПО ВТ_Регистрации.ДокументРегистрации = ВзвешиваниеВъезд.ДокументРегистрации
	|		И ВзвешиваниеВъезд.Проведен
	|		И ВзвешиваниеВъезд.ТипВзвешивания = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыВзвешивания.Въезд)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК ВзвешиваниеВыезд
	|		ПО ВТ_Регистрации.ДокументРегистрации = ВзвешиваниеВыезд.ДокументРегистрации
	|		И ВзвешиваниеВыезд.Проведен
	|		И ВзвешиваниеВыезд.ТипВзвешивания = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыВзвешивания.Выезд)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомпозитныеПробы КАК ВТ_КомпозитныеПробы
	|		ПО ВТ_Регистрации.ДокументРегистрации = ВТ_КомпозитныеПробы.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕдиничныеПробы КАК ВТ_ЕдиничныеПробы
	|		ПО ВТ_Регистрации.ДокументРегистрации = ВТ_ЕдиничныеПробы.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК
	|			СвязьРегистрацииИТранспортногоДокумента
	|		ПО ВТ_Регистрации.ДокументРегистрации = СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации
	|ГДЕ
	|	&ТекстУсловияПоНоменклатуре
	|	И &ТекстУсловияПоКонтрагенту
	|	И ВЫБОР
	|		КОГДА НЕ ВТ_КомпозитныеПробы.ДокументРегистрации ЕСТЬ NULL
	|		И НЕ ВТ_КомпозитныеПробы.ПроизводственныеСутки = &ПроизводственныеСутки
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ";

КонецФункции

Функция ТекстЗапросаДанныеДляПромежуточныхПроб()

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РегистрСведенийКомпозитныеПробы.КомпозитнаяПроба КАК ДокументФормированиеНомераПробы,
	|	МАКСИМУМ(ЛабораторныйАнализ.Ссылка) КАК ЛабораторныйАнализ
	|ПОМЕСТИТЬ ВТ_ПервичныеДанные
	|ИЗ
	|	РегистрСведений.гкс_КомпозитныеПробы КАК РегистрСведенийКомпозитныеПробы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|		ПО РегистрСведенийКомпозитныеПробы.КомпозитнаяПроба = ЛабораторныйАнализ.гкс_ДокументРегистрации
	|ГДЕ
	|	РегистрСведенийКомпозитныеПробы.ТочкаМаршрута = &ТочкаМаршрута
	|	И РегистрСведенийКомпозитныеПробы.ПроизводственныеСуткиРегистрации = &ПроизводственныеСутки
	|	И РегистрСведенийКомпозитныеПробы.ВидПеревозки = &ВидПеревозки
	|	И ЕСТЬNULL(ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества,
	|		ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПустаяСсылка)) В (&НазначенияИспользованияКачества)
	|СГРУППИРОВАТЬ ПО
	|	РегистрСведенийКомпозитныеПробы.КомпозитнаяПроба
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФНП.Ссылка,
	|	МАКСИМУМ(ЕСТЬNULL(СопоставлениеФНПЛА.ЛабораторныйАнализ, ЗНАЧЕНИЕ(Документ.гкс_ЛабораторныйАнализ.ПустаяСсылка)))
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы КАК ФНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФНПСписокРег
	|		ПО ФНП.Ссылка = ФНПСписокРег.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияЕдиничнойПробы
	|		ПО ФНПСписокРег.ДокументРегистрации = РегистрацияЕдиничнойПробы.Ссылка
	|		И РегистрацияЕдиничнойПробы.ВидПеревозки = &ВидПеревозки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СопоставлениеФНПЛабАнализа КАК СопоставлениеФНПЛА
	|		ПО ФНП.Ссылка = СопоставлениеФНПЛА.ФормированиеНомераПробы
	|		И
	|			СопоставлениеФНПЛА.НазначениеИспользования = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит)
	|ГДЕ
	|	ФНП.ТочкаМаршрута = &ТочкаМаршрута
	|	И ФНП.ПроизводственныеСуткиРегистрации = &ПроизводственныеСутки
	|	И ФНП.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
	|	И ФНП.Проведен
	|СГРУППИРОВАТЬ ПО
	|	ФНП.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПервичныеДанные.ДокументФормированиеНомераПробы КАК ДокументКомпозитнаяПроба,
	|	ВТ_ПервичныеДанные.ЛабораторныйАнализ КАК ПромежуточныйКомпозит,
	|	ВЫБОР
	|		КОГДА
	|			ВТ_ПервичныеДанные.ЛабораторныйАнализ.Статус = ЗНАЧЕНИЕ(Перечисление.гкс_СтатусыЛабораторногоАнализа.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.гкс_СтатусыЛабораторногоАнализа.ОтборПробы)
	|		ИНАЧЕ ВТ_ПервичныеДанные.ЛабораторныйАнализ.Статус
	|	КОНЕЦ КАК Статус,
	|	ВТ_ПервичныеДанные.ЛабораторныйАнализ.Номер КАК ЛабораторныйАнализНомер,
	|	ЕСТЬNULL(Номенклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ВТ_ПервичныеДанные.ДокументФормированиеНомераПробы.НомерПробы КАК НомерПробы
	|ИЗ
	|	ВТ_ПервичныеДанные КАК ВТ_ПервичныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ_ПервичныеДанные.ЛабораторныйАнализ.Номенклатура = Номенклатура.Ссылка";

КонецФункции

Функция ТекстЗапросаДанныеДляРегистрацииПромежуточныхПроб()

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрСведенийКомпозитныеПробы.ДокументРегистрации КАК ДокументРегистрации
	|ПОМЕСТИТЬ ВТ_ДокументРегистрации
	|ИЗ
	|	РегистрСведений.гкс_КомпозитныеПробы КАК РегистрСведенийКомпозитныеПробы
	|ГДЕ
	|	РегистрСведенийКомпозитныеПробы.КомпозитнаяПроба = &ДокументФормированиеНомераПробы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФНПСписокРег.ДокументРегистрации
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФНПСписокРег
	|ГДЕ
	|	ФНПСписокРег.Ссылка = &ДокументФормированиеНомераПробы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДокументРегистрации.ДокументРегистрации КАК ДокументРегистрации
	|ИЗ
	|	ВТ_ДокументРегистрации КАК ВТ_ДокументРегистрации";

КонецФункции

Функция ТекстЗапросаДанныеДляУсиленногоКонтроля()

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоказателиУсиленногоКонтроляПоРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	ПоказателиУсиленногоКонтроляПоРегистрации.Показатель КАК Показатель,
	|	ПоказателиУсиленногоКонтроляПоРегистрации.СостояниеКачества КАК СостояниеКачества,
	|	ПоказателиУсиленногоКонтроляПоРегистрации.ПроизводственныеСутки КАК ПроизводственныеСуткиУК
	|ПОМЕСТИТЬ ВТ_ПоказателиУсиленногоКонтроля
	|ИЗ
	|	РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК ПоказателиУсиленногоКонтроляПоРегистрации
	|ГДЕ
	|	ПоказателиУсиленногоКонтроляПоРегистрации.НазначениеИспользования = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит)
	|	И &ТекстУсловияПоСостояниюКачества
	|	И ПоказателиУсиленногоКонтроляПоРегистрации.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Композитная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	СостоянияРегистрации.Состояние КАК Состояние
	|ПОМЕСТИТЬ ВТ_РегистрацииПоОтборам
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних(, ВидПеревозки = &ВидПеревозки
	|	И ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|	И ТочкаМаршрута = &ТочкаМаршрута) КАК СостоянияРегистрации
	|ГДЕ
	|	СостоянияРегистрации.Период >= &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставГруппТранспорта.РегистрацияТранспорта КАК ДокументРегистрации,
	|	СоставГруппТранспорта.ГруппаТС КАК ГруппаТС
	|ПОМЕСТИТЬ ВТ_ГруппыТС
	|ИЗ
	|	РегистрСведений.гкс_СоставГруппТранспорта КАК СоставГруппТранспорта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РегистрацииПоОтборам КАК ВТ_РегистрацииПоОтборам
	|		ПО СоставГруппТранспорта.РегистрацияТранспорта = ВТ_РегистрацииПоОтборам.ДокументРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПоказателиУсиленногоКонтроля.Показатель КАК Показатель,
	|	ВТ_ПоказателиУсиленногоКонтроля.СостояниеКачества КАК СостояниеКачества,
	|	ВТ_ПоказателиУсиленногоКонтроля.ДокументРегистрации КАК ДокументРегистрации,
	|	ВТ_РегистрацииПоОтборам.Состояние КАК СостояниеРегистрации,
	|	ЕСТЬNULL(ВТ_ГруппыТС.ГруппаТС, ЗНАЧЕНИЕ(Справочник.гкс_ГруппыТС.ПустаяСсылка)) КАК ГруппаТС,
	|	ВТ_ПоказателиУсиленногоКонтроля.ПроизводственныеСуткиУК КАК ПроизводственныеСуткиУК
	|ПОМЕСТИТЬ ВТ_Регистрации
	|ИЗ
	|	ВТ_ПоказателиУсиленногоКонтроля КАК ВТ_ПоказателиУсиленногоКонтроля
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РегистрацииПоОтборам КАК ВТ_РегистрацииПоОтборам
	|		ПО ВТ_ПоказателиУсиленногоКонтроля.ДокументРегистрации = ВТ_РегистрацииПоОтборам.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГруппыТС КАК ВТ_ГруппыТС
	|		ПО ВТ_ПоказателиУсиленногоКонтроля.ДокументРегистрации = ВТ_ГруппыТС.ДокументРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КомпозитныеПробы.КомпозитнаяПроба КАК КомпозитнаяПроба,
	|	гкс_ЛабораторныйАнализКачественныеПоказатели.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТ_КомпозитныеПробыПоказатель
	|ИЗ
	|	РегистрСведений.гкс_КомпозитныеПробы КАК КомпозитныеПробы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
	|		ПО ВТ_Регистрации.ДокументРегистрации = КомпозитныеПробы.ДокументРегистрации
	|		И КомпозитныеПробы.ВидПеревозки = &ВидПеревозки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СопоставлениеФНПЛабАнализа КАК гкс_СопоставлениеФНПЛабАнализа
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК
	|				гкс_ЛабораторныйАнализКачественныеПоказатели
	|			ПО гкс_СопоставлениеФНПЛабАнализа.ЛабораторныйАнализ = гкс_ЛабораторныйАнализКачественныеПоказатели.Ссылка
	|		ПО КомпозитныеПробы.КомпозитнаяПроба = гкс_СопоставлениеФНПЛабАнализа.ФормированиеНомераПробы
	|ГДЕ
	|	ЕСТЬNULL(гкс_ЛабораторныйАнализКачественныеПоказатели.УсиленныйКонтроль, ЛОЖЬ)
	|	И ЕСТЬNULL(гкс_СопоставлениеФНПЛабАнализа.НазначениеИспользования,
	|		ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КомпозитныеПробы.ДокументРегистрации КАК ДокументРегистрации,
	|	КомпозитныеПробы.КомпозитнаяПроба КАК КомпозитнаяПроба,
	|	ЕСТЬNULL(СправочникНомераПроб.Код, """") КАК НомерКомпозитнойПробы,
	|	ВТ_Регистрации.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТ_КомпозитныеПробыДокументРегистрации
	|ИЗ
	|	РегистрСведений.гкс_КомпозитныеПробы КАК КомпозитныеПробы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
	|		ПО ВТ_Регистрации.ДокументРегистрации = КомпозитныеПробы.ДокументРегистрации
	|		И КомпозитныеПробы.ВидПеревозки = &ВидПеревозки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_НомерПробы КАК СправочникНомераПроб
	|			ПО ФормированиеНомераПробы.НомерПробы = СправочникНомераПроб.Ссылка
	|		ПО КомпозитныеПробы.КомпозитнаяПроба = ФормированиеНомераПробы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_КомпозитныеПробыДокументРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	ВТ_КомпозитныеПробыДокументРегистрации.КомпозитнаяПроба КАК КомпозитнаяПроба,
	|	ВТ_КомпозитныеПробыДокументРегистрации.НомерКомпозитнойПробы КАК НомерКомпозитнойПробы,
	|	ВТ_КомпозитныеПробыДокументРегистрации.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТ_КомпозитныеПробы
	|ИЗ
	|	ВТ_КомпозитныеПробыПоказатель КАК ВТ_КомпозитныеПробыПоказатель
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КомпозитныеПробыДокументРегистрации КАК ВТ_КомпозитныеПробыДокументРегистрации
	|		ПО ВТ_КомпозитныеПробыДокументРегистрации.КомпозитнаяПроба = ВТ_КомпозитныеПробыПоказатель.КомпозитнаяПроба
	|		И ВТ_КомпозитныеПробыДокументРегистрации.Показатель = ВТ_КомпозитныеПробыПоказатель.Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_Регистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	ФормированиеНомераПробы.Ссылка КАК ЕдиничнаяПроба,
	|	ЕСТЬNULL(СправочникНомераПроб.Код, """") КАК НомерПробы
	|ПОМЕСТИТЬ ВТ_ЕдиничныеПробы
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
	|		ПО ВТ_Регистрации.ДокументРегистрации = ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ФормированиеНомераПробы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_НомерПробы КАК СправочникНомераПроб
	|			ПО ФормированиеНомераПробы.НомерПробы = СправочникНомераПроб.Ссылка
	|		ПО ФормированиеНомераПробыСписокРегистраций.Ссылка = ФормированиеНомераПробы.Ссылка
	|		И ФормированиеНомераПробы.Проведен
	|		И ФормированиеНомераПробы.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрацияНаПЛК.Ссылка КАК ДокументРегистрации,
	|	РегистрацияНаПЛК.Дата КАК ДатаРегистрации,
	|	РегистрацияНаПЛК.Номер КАК НомерРегистрации,
	|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура,
	|	РегистрацияНаПЛК.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ЕСТЬNULL(ВТ_ЕдиничныеПробы.НомерПробы, """") КАК НомерПробы,
	|	ЕСТЬNULL(ВТ_КомпозитныеПробы.НомерКомпозитнойПробы, """") КАК НомерКомпозитнойПробы,
	|	РегистрацияНаПЛК.Контрагент КАК Контрагент,
	|	РегистрацияНаПЛК.Организация КАК Организация,
	|	РегистрацияНаПЛК.ВидПеревозки КАК ВидПеревозки,
	|	РегистрацияНаПЛК.ТочкаМаршрута КАК ПЛК,
	|	ЕСТЬNULL(ВТ_КомпозитныеПробы.КомпозитнаяПроба, ЗНАЧЕНИЕ(Документ.гкс_ФормированиеНомераПробы.ПустаяСсылка)) КАК
	|		ДокументКомпозитнаяПроба,
	|	ЕСТЬNULL(ВТ_ЕдиничныеПробы.ЕдиничнаяПроба, ЗНАЧЕНИЕ(Документ.гкс_ФормированиеНомераПробы.ПустаяСсылка)) КАК
	|		ФормированиеПробы,
	|	ВТ_Регистрации.СостояниеРегистрации КАК СостояниеРегистрации,
	|	ВТ_Регистрации.Показатель КАК Показатель,
	|	ВТ_Регистрации.СостояниеКачества КАК СостояниеКачества,
	|	ВТ_Регистрации.ГруппаТС КАК ГруппаТС,
	|	ЛОЖЬ КАК Пометка,
	|	ЕСТЬNULL(СтанцииЖД.Ссылка, ЗНАЧЕНИЕ(Справочник.гкс_КлассификаторСтанцийЖД.ПустаяСсылка)) КАК СтанцияОтправления,
	|	ЕСТЬNULL(СтанцииЖД.НаименованиеПолное, СТРОКА(10)) КАК СтанцияОтправленияПредставление
	|ИЗ
	|	ВТ_Регистрации КАК ВТ_Регистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ПО ВТ_Регистрации.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомпозитныеПробы КАК ВТ_КомпозитныеПробы
	|		ПО ВТ_Регистрации.ДокументРегистрации = ВТ_КомпозитныеПробы.ДокументРегистрации
	|		И ВТ_Регистрации.Показатель = ВТ_КомпозитныеПробы.Показатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕдиничныеПробы КАК ВТ_ЕдиничныеПробы
	|		ПО ВТ_Регистрации.ДокументРегистрации = ВТ_ЕдиничныеПробы.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК
	|			СвязьРегистрацииИТранспортногоДокумента
	|		ПО ВТ_Регистрации.ДокументРегистрации = СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент КАК ТранспортныйДокументСсылка
	|		ПО СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент = ТранспортныйДокументСсылка.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТочкиМаршрута КАК ПунктыПогрузки
	|		ПО ТранспортныйДокументСсылка.ПунктПогрузки = ПунктыПогрузки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_КлассификаторСтанцийЖД КАК СтанцииЖД
	|		ПО ПунктыПогрузки.КодСтанцииЖД = СтанцииЖД.Ссылка
	|ГДЕ
	|	&ТекстУсловияПоНоменклатуре
	|	И &ТекстУсловияПоКонтрагенту
	|	И ВТ_Регистрации.ПроизводственныеСуткиУК = &ПроизводственныеСутки";

КонецФункции

Функция ТекстЗапросаДанныеДляУсиленногоКонтроляДляТС()

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоказателиУсиленногоКонтроляПоРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	ПоказателиУсиленногоКонтроляПоРегистрации.Показатель КАК Показатель,
	|	ПоказателиУсиленногоКонтроляПоРегистрации.СостояниеКачества КАК СостояниеКачества,
	|	ПоказателиУсиленногоКонтроляПоРегистрации.ПроизводственныеСутки КАК ПроизводственныеСуткиУК
	|ПОМЕСТИТЬ ВТ_ПоказателиУсиленногоКонтроля
	|ИЗ
	|	РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК ПоказателиУсиленногоКонтроляПоРегистрации
	|ГДЕ
	|	ПоказателиУсиленногоКонтроляПоРегистрации.НазначениеИспользования = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит)
	|	И &ТекстУсловияПоСостояниюКачества
	|	И ПоказателиУсиленногоКонтроляПоРегистрации.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияРегистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	СостоянияРегистрации.Состояние КАК Состояние
	|ПОМЕСТИТЬ ВТ_РегистрацииПоОтборам
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних(, ВидПеревозки = &ВидПеревозки
	|	И ТипРегистрации = ЗНАЧЕНИЕ(Перечисление.гкс_ТипРегистрации.Приемка)
	|	И ТочкаМаршрута = &ТочкаМаршрута) КАК СостоянияРегистрации
	|ГДЕ
	|	СостоянияРегистрации.Период >= &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПоказателиУсиленногоКонтроля.Показатель КАК Показатель,
	|	ВТ_ПоказателиУсиленногоКонтроля.СостояниеКачества КАК СостояниеКачества,
	|	ВТ_ПоказателиУсиленногоКонтроля.ДокументРегистрации КАК ДокументРегистрации,
	|	ВТ_РегистрацииПоОтборам.Состояние КАК СостояниеРегистрации,
	|	ВТ_ПоказателиУсиленногоКонтроля.ПроизводственныеСуткиУК КАК ПроизводственныеСуткиУК
	|ПОМЕСТИТЬ ВТ_Регистрации
	|ИЗ
	|	ВТ_ПоказателиУсиленногоКонтроля КАК ВТ_ПоказателиУсиленногоКонтроля
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РегистрацииПоОтборам КАК ВТ_РегистрацииПоОтборам
	|		ПО ВТ_ПоказателиУсиленногоКонтроля.ДокументРегистрации = ВТ_РегистрацииПоОтборам.ДокументРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Регистрации.ДокументРегистрации КАК ДокументРегистрации,
	|	ФормированиеНомераПробы.Ссылка КАК ЕдиничнаяПроба,
	|	ЕСТЬNULL(СправочникНомераПроб.Код, """") КАК НомерПробы
	|ПОМЕСТИТЬ ВТ_ЕдиничныеПробы
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
	|		ПО ВТ_Регистрации.ДокументРегистрации = ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ФормированиеНомераПробы КАК ДокументФормированиеНомераПробы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_НомерПробы КАК СправочникНомераПроб
	|			ПО ДокументФормированиеНомераПробы.НомерПробы = СправочникНомераПроб.Ссылка
	|		ПО ФормированиеНомераПробыСписокРегистраций.Ссылка = ДокументФормированиеНомераПробы.Ссылка
	|		И ДокументФормированиеНомераПробы.Проведен
	|		И ДокументФормированиеНомераПробы.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Единичная)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СопоставлениеФНПЛабАнализа КАК СопоставлениеФНПЛА
	|		ПО ДокументФормированиеНомераПробы.Ссылка = СопоставлениеФНПЛА.ФормированиеНомераПробы
	|		И
	|			СопоставлениеФНПЛА.НазначениеИспользования = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрацияНаПЛК.Ссылка КАК ДокументРегистрации,
	|	РегистрацияНаПЛК.Дата КАК ДатаРегистрации,
	|	РегистрацияНаПЛК.Номер КАК НомерРегистрации,
	|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура,
	|	РегистрацияНаПЛК.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ЕСТЬNULL(ВТ_ЕдиничныеПробы.НомерПробы, """") КАК НомерПробы,
	|	РегистрацияНаПЛК.Контрагент КАК Контрагент,
	|	РегистрацияНаПЛК.Организация КАК Организация,
	|	РегистрацияНаПЛК.ВидПеревозки КАК ВидПеревозки,
	|	РегистрацияНаПЛК.ТочкаМаршрута КАК ПЛК,
	|	ЕСТЬNULL(ВТ_ЕдиничныеПробы.ЕдиничнаяПроба, ЗНАЧЕНИЕ(Документ.гкс_ФормированиеНомераПробы.ПустаяСсылка)) КАК
	|		ФормированиеПробы,
	|	ЕСТЬNULL(ВТ_ЕдиничныеПробы.ЕдиничнаяПроба, ЗНАЧЕНИЕ(Документ.гкс_ФормированиеНомераПробы.ПустаяСсылка)) КАК
	|		ДокументЕдиничнаяПроба,
	|	ВТ_Регистрации.СостояниеРегистрации КАК СостояниеРегистрации,
	|	ВТ_Регистрации.Показатель КАК Показатель,
	|	ВТ_Регистрации.СостояниеКачества КАК СостояниеКачества,
	|	ЛОЖЬ КАК Пометка,
	|	ЕСТЬNULL(СтанцииЖД.Ссылка, ЗНАЧЕНИЕ(Справочник.гкс_КлассификаторСтанцийЖД.ПустаяСсылка)) КАК СтанцияОтправления,
	|	ЕСТЬNULL(СтанцииЖД.НаименованиеПолное, СТРОКА(10)) КАК СтанцияОтправленияПредставление,
	|	ВТ_Регистрации.ПроизводственныеСуткиУК КАК ПроизводственныеСутки,
	|	ЕСТЬNULL(ЗаблокированныеРегистрации.БлокирующееСостояниеКачества,
	|		ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияКачества.ПустаяСсылка)) КАК БлокирующееСостояниеКачества,
	|	ЕСТЬNULL(ЗаблокированныеРегистрации.БлокирующаяГруппаТС, ЗНАЧЕНИЕ(Справочник.гкс_ГруппыТС.ПустаяСсылка)) КАК
	|		БлокирующаяГруппаТС,
	|	ЕСТЬNULL(ЗаблокированныеРегистрации.БлокирующаяРегистрация, ЗНАЧЕНИЕ(Документ.гкс_РегистрацияНаПЛК.ПустаяСсылка)) КАК
	|		БлокирующаяРегистрация,
	|	ЕСТЬNULL(БлокирующаяРегистрацияДанные.Номер, """") КАК НомерБлокирующейРегистрации
	|ИЗ
	|	ВТ_Регистрации КАК ВТ_Регистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ПО ВТ_Регистрации.ДокументРегистрации = РегистрацияНаПЛК.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕдиничныеПробы КАК ВТ_ЕдиничныеПробы
	|		ПО ВТ_Регистрации.ДокументРегистрации = ВТ_ЕдиничныеПробы.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК
	|			СвязьРегистрацииИТранспортногоДокумента
	|		ПО ВТ_Регистрации.ДокументРегистрации = СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент КАК ТранспортныйДокументСсылка
	|		ПО СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент = ТранспортныйДокументСсылка.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТочкиМаршрута КАК ПунктыПогрузки
	|		ПО ТранспортныйДокументСсылка.ПунктПогрузки = ПунктыПогрузки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_КлассификаторСтанцийЖД КАК СтанцииЖД
	|		ПО ПунктыПогрузки.КодСтанцииЖД = СтанцииЖД.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ЗаблокированныеРегистрацииУсиленныйКонтроль КАК ЗаблокированныеРегистрации
	|		ПО ВТ_Регистрации.ДокументРегистрации = ЗаблокированныеРегистрации.ДокументРегистрации
	|		И ВТ_Регистрации.Показатель = ЗаблокированныеРегистрации.Показатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК БлокирующаяРегистрацияДанные
	|		ПО ЗаблокированныеРегистрации.БлокирующаяРегистрация = БлокирующаяРегистрацияДанные.Ссылка
	|ГДЕ
	|	&ТекстУсловияПоНоменклатуре
	|	И &ТекстУсловияПоКонтрагенту
	|	И ВТ_Регистрации.ПроизводственныеСуткиУК = &ПроизводственныеСутки";

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
